# -*- coding: utf-8 -*-
# --------------------------------------
# @Time    : 2019/10/14 15:10
# @Author  : hxf
# @Email   : 1870212598@qq.com
# @File    : shuju2_pandas.py
# Description :pandas模块
# ----------------------------------
'''
panda模块：
	Series #index 索引
	DataFrame # columns列名
'''
import pandas as pda

print('--------------------------Series创建一串数据-----------------------------')
a=pda.Series([8,9,2,1])
print(a)
'''
0    8
1    9
2    2
3    1
dtype: int64
'''
#指定索引
b=pda.Series([8,9,2,1],index=['One','Two','Three','Four'])
print(b)
'''
One      8
Two      9
Three    2
Four     1
dtype: int64
'''
print('--------------------------DataFrame 创建数据框-----------------------------')
c=pda.DataFrame([[5,6,2,3],[8,4,6,3],[6,4,31,2]])
print(c)
'''
   0  1   2  3
0  5  6   2  3
1  8  4   6  3
2  6  4  31  2
'''
print('-------------------------------------------------------')
d=pda.DataFrame([[5,6,2,3],[8,4,6,3],[6,4,31,2]],columns=['One','Two','Three','Four'])#指定列名
print(d)
'''
   One  Two  Three  Four
0    5    6      2     3
1    8    4      6     3
2    6    4     31     2
'''
print('-------------------------------------------------------')
e=pda.DataFrame({                   # 通过字典创建数据
	"one":4,
	"two":[6,2,3],
	"three":list(str(982))
})
print(e)
'''
    one  two three
0    4    6     9
1    4    2     8
2    4    3     2
'''
print('-------------------------------------------------------')
print(d.head())      # 头部数据，默认前5行
'''
   One  Two  Three  Four
0    5    6      2     3
1    8    4      6     3
2    6    4     31     2
'''
print('-------------------------------------------------------')
print(d.tail(2))     # 取后两行
'''
   One  Two  Three  Four
1    8    4      6     3
2    6    4     31     2
'''
print('-------------------------------------------------------')
print(d.describe())  # 按列统计描述
'''
            One       Two      Three      Four
count  3.000000  3.000000   3.000000  3.000000
mean   6.333333  4.666667  13.000000  2.666667
std    1.527525  1.154701  15.716234  0.577350
min    5.000000  4.000000   2.000000  2.000000
25%    5.500000  4.000000   4.000000  2.500000
50%    6.000000  4.000000   6.000000  3.000000
75%    7.000000  5.000000  18.500000  3.000000
max    8.000000  6.000000  31.000000  3.000000
'''
#转置
print('-------------------------------------------------------')
print(d.T)
'''
       0  1   2
One    5  8   6
Two    6  4   4
Three  2  6  31
Four   3  3   2
'''
