# -*- coding: utf-8 -*-
# --------------------------------------
# @Time    : 2019/10/14 14:32
# @Author  : hxf
# @Email   : 1870212598@qq.com
# @File    : shuju1_numpy.py
# Description :numpy模块
# ----------------------------------
'''
1、创建数组格式
	一维数组：numpy.array([元素1,元素2,元素3,...,元素n])
	二维数据：numpy.array([[元素1,元素2,...,元素n],[元素1,元素2,...,元素n],[元素1,元素2,...,元素n]])
2、数组排序
	sort()
3、数组取最大值和最小值
	max()、min()
4、数组的切片操作
	数组[起始下标:最终下标+1]

'''
import numpy as np

#创建数组
print('---------------------一维数组---------------------')
x=np.array(["a","8","9","12"])
print(x)
print(type(x))

print('---------------------二维数组----------------------')
y=np.array([[1,7,3],[5,8,2],[9,4,7]])
print(y)
print(type(y))
print('---------------------取特定元素---------------------')
print(x[2])
print(y[1][2])

#数组排序
print('---------------------排序后的数组---------------------')
x.sort()
print(x)
y.sort()
print(y)

#数组最大值和最小值
print('---------------------数组最大值和最小值---------------------')
y1=y.max() #list中也有求max和min，但数组的效率高
y2=y.min()
print('y的最大值：',y1)
print('y的最小值：',y2)

#数组的切片操作
print(x[1:3]) #1-2号元素




